Tekla Open API Reference for Tekla Structures 2025
Angle.FromCurrentUnit Method
 Creates an angle given in the current unit type
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static Angle FromCurrentUnit(
	double angle
)
Public Shared Function FromCurrentUnit (
	angle As Double
) As Angle
Parameters
angle
Type: System.Double
Angle given in the current unit type
Return Value
Type: Angle
An Angle object representing the given angle
See Also
Reference
Angle Class
Tekla.Structures.Datatype Namespace